{
  "Aphids": "**1. Immediate Containment Protocols:**\n- Remove and destroy heavily infested plants to reduce aphid population.\n- Use yellow sticky traps at crop height to monitor and control adult aphids.\n- Initiate foliar sprays with recommended insecticides immediately.\n\n**2. Approved Insecticides and Application Rates:**\n- Imidacloprid 17.8% SL @ 0.3 ml/L of water.\n- Thiamethoxam 25% WG @ 0.25 g/L of water.\n- Dimethoate 30% EC @ 1.5 ml/L of water.\n- Apply early morning or late evening; avoid application during flowering to protect pollinators.\n\n**3. Cultural Management Practices:**\n- Avoid excess nitrogen fertilizers; promotes soft new growth favored by aphids.\n- Encourage natural predators (lady beetles, lacewings).\n- Use border cropping with trap crops (e.g., mustard).\n- Maintain proper plant spacing for airflow and sunlight penetration.\n\n**4. Soil Treatment Recommendations:**\n- Apply neem cake @ 200 kg/ha to reduce soil-borne pest populations.\n- Maintain soil pH between 6.0 and 6.5 using lime amendments.\n- Ensure proper drainage to avoid stress that attracts aphid infestations.\n\n**5. Long-Term Crop Rotation Strategies:**\n- Rotate cotton with non-host crops like sorghum or maize.\n- Avoid continuous cotton cropping to prevent aphid buildup.\n- Include legumes (e.g., cowpea) to improve soil health and break pest cycles.\n\n**6. Expected Recovery Progression:**\n- Visible reduction in aphid population within 7–10 days of effective treatment.\n- Plant vigor may return in 2–3 weeks with proper nutrition and pest control.\n- Monitor for resurgence and treat preventively in subsequent weeks.\n\n**7. Quarantine Measures if Needed:**\n- Isolate severely affected plots; restrict human and equipment movement.\n- Sanitize tools and machinery between plots.\n- Notify local agricultural authorities if infestation spreads beyond control.",
  "Bacterial blight": "**1. Immediate Containment Protocols:**\n- Remove and destroy all visibly infected plants and residues.\n- Avoid overhead irrigation to reduce leaf wetness.\n- Disinfect tools and machinery with 1% sodium hypochlorite or 70% ethanol.\n- Restrict movement of people, animals, and equipment across infected fields.\n\n**2. Approved Fungicides/Bactericides with Application Rates:**\n- **Copper oxychloride (50% WP)** Apply at 2.5 g/L water, repeat every 7–10 days.\n- **Streptomycin sulphate + Tetracycline combination** 200 ppm foliar spray, every 7 days.\n- **Kasugamycin 3% SL** Apply at 500 mL/ha in 500 L water.\n\n**3. Cultural Management Practices:**\n- Use certified, disease-free seeds resistant to bacterial blight (e.g., Bt hybrids with blight resistance).\n- Practice crop sanitation: remove volunteer plants and plant debris.\n- Maintain wider row spacing to enhance air circulation.\n- Avoid excessive nitrogen fertilization.\n\n**4. Soil Treatment Recommendations:**\n- Apply well-decomposed farmyard manure enriched with *Trichoderma* spp.\n- Maintain pH near neutrality by applying lime or dolomite if feasible.\n- Ensure proper drainage to prevent waterlogging.\n\n**5. Long-term Crop Rotation Strategies:**\n- Rotate with non-host crops like sorghum, maize, or groundnut for at least 2 years.\n- Avoid successive planting of cotton or other malvaceous crops.\n\n**6. Expected Recovery Progression:**\n- If actioned immediately, visible symptom suppression in 10–15 days.\n- Plant recovery and new growth within 3 weeks under optimal management.\n- Yield reduction likely but can be minimized with aggressive early intervention.\n\n**7. Quarantine Measures if Needed:**\n- Isolate infected field blocks and restrict entry.\n- Monitor neighboring fields regularly for symptoms.\n- Report outbreaks to agricultural extension officers for regional containment.",
  "Army worm": "**1. Immediate Containment Protocols:**\n- Manually remove and destroy larvae from affected plants.\n- Apply pheromone traps (20/ha) to monitor and reduce adult moth populations.\n- Spray neem-based bio-pesticide (Azadirachtin 1500 ppm) as an eco-friendly immediate measure.\n\n**2. Approved Insecticides (Armyworm is an insect pest, not fungal/bacterial):**\n- *Spinetoram 11.7% SC* at 600 ml/ha.\n- *Emamectin Benzoate 5% SG* at 220 g/ha.\n- *Chlorantraniliprole 18.5% SC* at 150 ml/ha.\n- Always apply in evening hours to target active larvae and avoid pollinator exposure.\n\n**3. Cultural Management Practices:**\n- Deep summer ploughing to destroy pupae in soil.\n- Remove and destroy crop residues post-harvest.\n- Avoid monoculture; encourage intercropping with legumes or sorghum.\n- Maintain plant spacing and weed control to reduce habitat for larvae.\n\n**4. Soil Treatment Recommendations:**\n- Incorporate neem cake (250 kg/ha) into soil to enhance insecticidal properties.\n- Apply *Trichoderma harzianum* (2.5 kg/ha with FYM) to improve soil health and suppress secondary pathogens.\n- Regularly monitor soil pH; consider liming to gradually raise pH from 5.5 to 6.5 for optimal cotton growth.\n\n**5. Long-term Crop Rotation Strategies:**\n- Rotate cotton with non-host crops like cereals (maize, sorghum) for at least one season.\n- Avoid continuous cotton or soybean-cotton cycles which favor pest buildup.\n- Integrate legume rotation (e.g., cowpea, green gram) to restore soil nitrogen and break pest cycle.\n\n**6. Expected Recovery Progression:**\n- Visible decline in larvae population within 5–7 days post insecticide application.\n- Gradual crop recovery over 2–3 weeks with reduced defoliation.\n- Yield loss can be minimized if action is taken swiftly during early to mid infestation.\n\n**7. Quarantine Measures (if infestation spreads):**\n- Restrict movement of plant material and machinery from infected fields.\n- Establish buffer zones with untreated vegetation or trap crops.\n- Notify local agricultural department for coordinated surveillance and management.",
  "Healthy": "**Response:** No action needed.\n\n Maintain current management practices. Regular monitoring for pests and diseases is recommended. Ensure proper irrigation, fertilization, and pest control measures are in place to sustain plant health.",
  "Powdery mildew": "**Immediate Containment Protocols:**\n- Isolate severely affected plants to prevent spore spread.\n- Avoid overhead irrigation to reduce leaf wetness duration.\n- Remove and destroy infected plant debris outside field boundaries.\n- Restrict human and machinery movement between infected and healthy plots.\n\n**Approved Fungicides with Application Rates:**\n- Sulfur 80% WP: Apply at 2–3 kg/ha with 500–750 L water per hectare.\n- Hexaconazole 5% EC: Apply at 1 ml/L of water; repeat every 10–15 days if needed.\n- Myclobutanil 10% WP: Apply at 0.1% concentration.\n- Ensure early morning or late evening spraying for best efficacy.\n\n**Cultural Management Practices:**\n- Increase plant spacing to improve airflow.\n- Prune lower leaves to reduce humidity in canopy.\n- Avoid excessive nitrogen fertilizer as it promotes lush foliage.\n- Maintain field hygiene and regularly scout for symptoms.\n\n**Soil Treatment Recommendations:**\n- Apply *Trichoderma viride* or *Pseudomonas fluorescens* as a bio-control agent (2.5 kg/ha mixed with 50 kg FYM).\n- Maintain organic matter with compost to enhance microbial activity.\n- Use lime to adjust soil pH slightly toward neutral (add 100–200 kg/ha of agricultural lime).\n\n**Long-term Crop Rotation Strategies:**\n- Rotate with non-host crops like sorghum, groundnut, or pulses for 2–3 seasons.\n- Avoid repeated cotton cultivation in the same plot to prevent inoculum buildup.\n\n**Expected Recovery Progression:**\n- Visible symptom reduction within 7–10 days post fungicide application.\n- Full recovery and resumed growth expected within 2–3 weeks under optimal conditions.\n- Yield impact depends on growth stage at infection; early-stage infections have higher recovery potential.\n\n**Quarantine Measures if Needed:**\n- Impose field-level quarantine for critically infected plots.\n- Sanitize tools and footwear with 1% sodium hypochlorite after field work.\n- Prevent cross-contamination by using separate equipment for infected fields.",
  "Target spot": "**1. Immediate Containment Protocols:**\n- Remove and destroy heavily infected plants to reduce inoculum load.\n- Avoid irrigation methods that wet foliage (e.g., overhead irrigation).\n- Restrict field access to minimize pathogen spread.\n\n**2. Approved Fungicides/Bactericides with Application Rates:**\n- **Fluxapyroxad + Pyraclostrobin** (e.g., Merivon) at 200–300 ml/ha.\n- **Azoxystrobin** (e.g., Amistar) at 500 ml/ha.\n- **Chlorothalonil** (contact fungicide) at 1.0–1.5 L/ha as a tank mix.\n- Apply at 10–14 day intervals, with 2–3 applications based on severity and rainfall.\n\n**3. Cultural Management Practices:**\n- Increase row spacing for better air circulation.\n- Avoid late-season nitrogen applications that promote excessive canopy.\n- Implement timely weeding to reduce alternate host presence.\n- Use drip irrigation to avoid wetting leaves.\n\n**4. Soil Treatment Recommendations:**\n- Apply **Trichoderma harzianum** (2.5 kg/ha with 50 kg compost) to suppress soil-borne phases.\n- Improve drainage to prevent prolonged moisture retention.\n- Adjust pH using lime application if needed to approach neutral levels.\n\n**5. Long-term Crop Rotation Strategies:**\n- Rotate with non-host crops like sorghum, maize, or pulses for 1–2 seasons.\n- Avoid legume or solanaceous crops which may harbor *Alternaria* spp.\n\n**6. Expected Recovery Progression:**\n- Noticeable reduction in new lesions within 10–14 days post-treatment.\n- Yield loss may be partially mitigated if managed promptly at early boll setting.\n- Full recovery dependent on weather moderation and consistent fungicide program.\n\n**7. Quarantine Measures (If Needed):**\n- Avoid movement of plant material from infected fields to uninfected zones.\n- Disinfect tools and machinery between fields.\n- Notify nearby growers for coordinated area-wide management."
}
